DataProcessors/ПечатьЭтикетокИЦенниковБПО.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<DataProcessor>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ПечатьЭтикетокИЦенниковБПО</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ТорговыйОбъектБПО</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ТорговыйОбъектБПО</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПечатьНаОбычномПринтере</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВидЦены</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ВидЦеныБПО</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВидЦеныАкционный</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ВидЦеныБПО</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>КаждаяЭтикеткаНаНовомЛисте</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>РежимПечати</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>128</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Выбран</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>НоменклатураБПО</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.НоменклатураБПО</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ХарактеристикаБПО</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ХарактеристикаБПО</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>УпаковкаБПО</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.УпаковкаБПО</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ОрганизацияБПО</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ОрганизацияБПО</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Цена</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаНеотрицательная</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Штрихкод</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ШаблонЦенникаЭтикетки</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ШаблоныЭтикетокИЦенниковБПО</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

DataProcessors/ПечатьЭтикетокИЦенниковБПО/Forms/Форма/Ext/Form/Module.bsl
&НаСервере
&Вместо("ПриСозданииНаСервере")
Процедура АС_ПередПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	// В рабочей конфигурации штатная инициализация формы уже была выполнена
	// другим слоем расширения. Повторный запуск добавляет те же реквизиты,
	// повторно загружает товары и второй раз дописывает "по объекту" в заголовок.
	ПартияСоздана = Ложь;
	СерияСоздана = Ложь;
	ШтрихАвтопроверкиСоздан = Ложь;
	Для Каждого РеквизитФормы Из ПолучитьРеквизиты("Объект.Товары") Цикл
		Если РеквизитФормы.Имя = "Партия" Тогда
			ПартияСоздана = Истина;
		ИначеЕсли РеквизитФормы.Имя = "Серия" Тогда
			СерияСоздана = Истина;
		ИначеЕсли РеквизитФормы.Имя = "ШтрихАвтопроверки" Тогда
			ШтрихАвтопроверкиСоздан = Истина;
		КонецЕсли;
	КонецЦикла;
	Если ПартияСоздана И СерияСоздана И ШтрихАвтопроверкиСоздан Тогда
		Возврат;
	КонецЕсли;

	ПродолжитьВызов(Отказ, СтандартнаяОбработка);

КонецПроцедуры

&НаКлиенте
Процедура АС_Печать(Команда)

	Для Каждого СтрокаТовара Из Объект.Товары Цикл
		Если СтрокаТовара.Выбран И Не ЗначениеЗаполнено(СтрокаТовара.Штрихкод) Тогда
			Оповещение = Новый ОписаниеОповещения(
				"АС_ПечатьПослеПредупреждения", ЭтотОбъект);
			ПоказатьВопрос(
				Оповещение,
				НСтр("ru = 'Для одного или нескольких выбранных товаров не указан штрихкод. Продолжить печать?'"),
				РежимДиалогаВопрос.ДаНет,
				0,
				КодВозвратаДиалога.Нет);
			Возврат;
		КонецЕсли;
	КонецЦикла;

	Печать(Команда);

КонецПроцедуры

&НаКлиенте
Процедура АС_ПечатьПослеПредупреждения(Ответ, ДополнительныеПараметры) Экспорт

	Если Ответ = КодВозвратаДиалога.Да Тогда
		Печать(Неопределено);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура АС_ОтметитьВсе(Команда)

	КоличествоОтмеченных = 0;
	Для Каждого СтрокаТовара Из Объект.Товары Цикл
		СтрокаТовара.Выбран = ПроверитьВозможностьВыбораТовара(СтрокаТовара);
		Если СтрокаТовара.Выбран Тогда
			КоличествоОтмеченных = КоличествоОтмеченных + 1;
		КонецЕсли;
	КонецЦикла;

	ПоказатьОповещениеПользователюОВозможнойОшибке(
		"", КоличествоОтмеченных, Объект.Товары.Количество());

КонецПроцедуры

&НаКлиенте
Процедура АС_СнятьВсеОтметки(Команда)

	Для Каждого СтрокаТовара Из Объект.Товары Цикл
		СтрокаТовара.Выбран = Ложь;
	КонецЦикла;

КонецПроцедуры
